[{"school":"INFO","num":343,"title":"Client-Side Web Development","quarter":"Autumn","year":2015,"desc":"Introduction to client-side web development including markup, programming, protocols, libraries, frameworks, and techniques for creating effective, usable, dynamic, and responsive applications that meet user needs. Includes an introduction to web development roles within organizations, content management systems, and other tools to build and manage websites and applications."},
{"school":"INFO","num":340,"title":"Introduction to Relational Database Management Systems","quarter":"Autumn","year":2015,"desc":"Introduction to relational database management systems, focused on relational theory and the application of conceptual, logical, and physical database modeling. Key topics include the relational model, SQL, entity-relationship modeling, three-tier architectures, implementation of database applications, and related topics in information systems."},
{"school":"INFO","num":424,"title":"Information Visualization and Aesthetic","quarter":"Spring","year":2015,"desc":"Build fluency in expressing information visually as diagrams, charts, maps, and icons Learn to solve design problems; give and receive critique; follow an iterative process of design refinement; and learn technical skills with design tools, such as Illustrator and Tableau. Understand the nature of visual potential, visual design principles, and the impact of color and typography."},
{"school":"INFO","num":341,"title":"Computer Networks and Distributed Applications","quarter":"Spring","year":2015,"desc":"Basic concepts of local and wide-area computer networking including an overview of services provided by networks, network topologies and hardware, packet switching, client/server architectures, network protocols, and network servers and applications. Also addresses management, security, authentication, and policy issues associated with distributed systems."},
{"school":"INFO","num":380,"title":"Information Systems Analysis and Design","quarter":"Winter","year":2015,"desc":"Prepares students to participate in structured systems analysis and design efforts. Students learn how to analyze system context, behavior, and structure; identify stakeholders; gather requirements; and redesign systems to make them more beneficial to the organization."},
{"school":"MATH","num":390,"title":"Statistical Methods in Engineering and Science","quarter":"Winter","year":2015,"desc":"Concepts of probability and statistics. Conditional probability, independence, random variables, distribution functions. Descriptive statistics, transformations, sampling errors, confidence intervals, least squares and maximum likelihood. Exploratory data analysis and interactive computing."},
{"school":"INFO","num":481,"title":"Project Management","quarter":"Autumn","year":2014,"desc":"Introduces project management principles within the context of Informatics. Provides knowledge that managers need to implement information systems on time and within budget. Concentrates on methods and issues in organizing, planning, and controlling projects, and the use of computer-based project management tools."},
{"school":"INFO","num":444,"title":"Value-Sensitive Design","quarter":"Autumn","year":2014,"desc":"Introduction to value-sensitive design (VSD), information system design that accounts for human values in a principled and comprehensive manner. Examination of existing systems from a VSD perspective. Explores VSD research methods including conceptual, technical, empirical investigations. Key values include accountability, autonomy, consent, privacy, property, trust, sustainability."},
{"school":"MATH","num":324,"title":"Advanced Multivariable Calculus I","quarter":"Winter","year":2014,"desc":"Topics include double and triple integrals, the chain rule, vector fields, line and surface integrals. Culminates in the theorems of Green and Stokes, along with the Divergence Theorem."},
{"school":"CSE","num":154,"title":"Web Programming","quarter":"Spring","year":2014,"desc":"Covers languages, tools, and techniques for developing interactive and dynamic web pages. Topics include page styling, design, and layout; client and server side scripting; web security; and interacting with data sources such as databases."},
{"school":"CSE","num":373,"title":"Data Structures and Algorithms","quarter":"Winter","year":2014,"desc":"Fundamental algorithms and data structures for implementation. Techniques for solving problems by programming. Linked lists, stacks, queues, directed graphs. Trees: representations, traversals. Searching (hashing, binary search trees, multiway trees). Garbage collection, memory management. Internal and external sorting."},
{"school":"MATH","num":309,"title":"Linear Analysis","quarter":"Autumn","year":2013,"desc":"First order systems of linear differential equations, Fourier series and partial differential equations, and the phase plane."},
{"school":"INFO","num":200,"title":"Intellectual Foundations of Informatics","quarter":"Spring","year":2013,"desc":"Information as an object of study, including theories, concepts, and principles of information, information seeking, cognitive processing, knowledge representation and restructuring, and their relationships to physical and intellectual access to information. Development of information systems for storage, organization, and retrieval. Experience in the application of theories, concepts, and principles."},
{"school":"CSE","num":143,"title":"Computer Programming II","quarter":"Spring","year":2013,"desc":"Continuation of CSE 142. Concepts of data abstraction and encapsulation including stacks, queues, linked lists, binary trees, recursion, instruction to complexity and use of predefined collection classes."},
{"school":"MATH","num":308,"title":"Matrix Algebra with Applications","quarter":"Spring","year":2013,"desc":"Systems of linear equations, vector spaces, matrices, subspaces, orthogonality, least squares, eigenvalues, eigenvectors, applications. For students in engineering, mathematics, and the sciences."},
{"school":"CSE","num":142,"title":"Computer Programming I","quarter":"Winter","year":2013,"desc":"Basic programming-in-the-small abilities and concepts including procedural programming (methods, parameters, return, values), basic control structures (sequence, if/else, for loop, while loop), file processing, arrays, and an introduction to defining objects. Intended for students without prior programming experience."},
{"school":"MATH","num":307,"title":"Introduction to Differential Equations","quarter":"Winter","year":2013,"desc":"Introductory course in ordinary differential equations. Includes first- and second-order equations and Laplace transform."}]